## Central account
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.log_archive_read must be replaced
-/+ resource "aws_iam_policy" "log_archive_read" {
      ~ arn       = "arn:aws:iam::871282759583:policy/CbsASEAReaderRole" -> (known after apply)
      ~ id        = "arn:aws:iam::871282759583:policy/CbsASEAReaderRole" -> (known after apply)
      ~ name      = "CbsASEAReaderRole" -> "CbsLogArchiveBucketRead" # forces replacement
      ~ policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = [
                            "s3:ListBucket",
                            "s3:GetObject",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::cbs-log-archive-871282759583/*",
                            "arn:aws:s3:::cbs-log-archive-871282759583",
                        ]
                        Sid      = ""
                    },
                    {
                        Action   = "kms:Decrypt"
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:ca-central-1:871282759583:key/c4591f87-9445-4840-acb6-a5569e703c93"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id = "ANPA4VXD726PUXKJCTVB3" -> (known after apply)
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.log_archive_read must be replaced
-/+ resource "aws_iam_role" "log_archive_read" {
      ~ arn                   = "arn:aws:iam::871282759583:role/CbsLogArchiveBucketRead" -> (known after apply)
      ~ assume_role_policy    = (sensitive)
      ~ create_date           = "2022-01-27T20:58:02Z" -> (known after apply)
      - description           = "" -> null
      ~ id                    = "CbsLogArchiveBucketRead" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::871282759583:policy/CbsASEAReaderRole",
        ] -> (known after apply)
      ~ name                  = "CbsLogArchiveBucketRead" -> "CbsASEAReaderRole" # forces replacement
      ~ name_prefix           = "" -> (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA4VXD726P5KLJGEGDG" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.log_archive_read must be replaced
-/+ resource "aws_iam_role_policy_attachment" "log_archive_read" {
      ~ id         = "CbsLogArchiveBucketRead-20220203180620828900000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::871282759583:policy/CbsASEAReaderRole" -> (known after apply) # forces replacement
      ~ role       = "CbsLogArchiveBucketRead" -> "CbsASEAReaderRole" # forces replacement
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.log_archive_encrypt"]

11 tests, 8 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
